---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ElectricityFailures.InvalidPoleNumber
source: html/abbcd86a-9f8c-63f0-6684-497b57c16b7a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ElectricityFailures.InvalidPoleNumber Property

The panel is single phase [wire] wires. The number of poles can not be larger than [value].

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidPoleNumber { get; }
```